# Используйте официальный образ Go для сборки приложения
FROM golang:1.17 AS builder

# Установите рабочую директорию
WORKDIR /ImagoLab-back

# Копируйте модули Go и загрузите зависимости
COPY go.mod go.sum ./
RUN go mod download

# Копируйте остальной исходный код
COPY . .

# Соберите приложение
RUN ./run.sh

# Используйте минимальный образ для запуска
FROM alpine:latest

# Установите рабочую директорию
WORKDIR /app

# Копируйте скомпилированное приложение из предыдущего этапа
COPY --from=builder /app/main .

# Откройте необходимый порт (замените на порт вашего приложения)
EXPOSE 8082 8446

# Запустите приложение
CMD ["./server"]